#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      - attributes = {} -> null
      - client_id  = "82b03c5f-8498-4762-b24c-7ab0a792debf" -> null
      - id         = "f5426c7a-1a7b-44a8-8052-8bd86cf17058" -> null
      - name       = "hsiar_phar" -> null
      - realm_id   = "moh_applications" -> null
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.module.client-roles.keycloak_role.ROLES["hsiar_ppd"] will be destroyed
  # (because key ["hsiar_ppd"] is not in for_each map)
  - resource "keycloak_role" "ROLES" {
      - attributes = {} -> null
      - client_id  = "82b03c5f-8498-4762-b24c-7ab0a792debf" -> null
      - id         = "997fbeb1-f4c9-412a-9df6-e957fac529f1" -> null
      - name       = "hsiar_ppd" -> null
      - realm_id   = "moh_applications" -> null
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.module.client-roles.keycloak_role.ROLES["hsiar_wfa"] will be destroyed
  # (because key ["hsiar_wfa"] is not in for_each map)
  - resource "keycloak_role" "ROLES" {
      - attributes = {} -> null
      - client_id  = "82b03c5f-8498-4762-b24c-7ab0a792debf" -> null
      - id         = "b1f9c2f5-6cdd-475b-85d3-a008f69ad515" -> null
      - name       = "hsiar_wfa" -> null
      - realm_id   = "moh_applications" -> null
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.module.client-roles.keycloak_role.ROLES["opho"] will be destroyed
  # (because key ["opho"] is not in for_each map)
  - resource "keycloak_role" "ROLES" {
      - attributes = {} -> null
      - client_id  = "82b03c5f-8498-4762-b24c-7ab0a792debf" -> null
      - id         = "d35479e4-3ed4-4f6d-b1d6-696700bfd4c7" -> null
      - name       = "opho" -> null
      - realm_id   = "moh_applications" -> null
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["hsiar_dart"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "hsiar_dart"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["hsiar_phar"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "hsiar_phar"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["hsiar_ppd"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "hsiar_ppd"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["hsiar_wfa"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "hsiar_wfa"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PHO-RSC-GROUPS.module.client-roles.keycloak_role.ROLES["opho"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "opho"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-pho-rsc-groups"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "64028a9d-1033-438f-8db8-681dc0a97e51"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-pho-rsc-groups"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "bd2e86ec-254f-4ddf-82f3-6e31e70b5bd8"
      + id        = (known after apply)
      + name      = "view-client-pho-rsc-groups"
      + realm_id  = "moh_applications"
    }

Plan: 8 to add, 3 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*